PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_i3c_v1_1.h
/* I3C_CORE.DEVICE_CTRL */
#define I3C_CORE_DEVICE_CTRL_IBA_INCLUDE_Pos    0UL
#define I3C_CORE_DEVICE_CTRL_IBA_INCLUDE_Msk    0x1UL
#define I3C_CORE_DEVICE_CTRL_I2C_TARGET_PRESENT_Pos 7UL
#define I3C_CORE_DEVICE_CTRL_I2C_TARGET_PRESENT_Msk 0x80UL
#define I3C_CORE_DEVICE_CTRL_HOT_JOIN_CTRL_Pos  8UL
#define I3C_CORE_DEVICE_CTRL_HOT_JOIN_CTRL_Msk  0x100UL
#define I3C_CORE_DEVICE_CTRL_IDLE_CNT_MULTPLIER_Pos 24UL
#define I3C_CORE_DEVICE_CTRL_IDLE_CNT_MULTPLIER_Msk 0x3000000UL
#define I3C_CORE_DEVICE_CTRL_TARGET_PEC_EN_Pos  26UL
#define I3C_CORE_DEVICE_CTRL_TARGET_PEC_EN_Msk  0x4000000UL
#define I3C_CORE_DEVICE_CTRL_ADAPTIVE_I2C_I3C_Pos 27UL
#define I3C_CORE_DEVICE_CTRL_ADAPTIVE_I2C_I3C_Msk 0x8000000UL
#define I3C_CORE_DEVICE_CTRL_ABORT_Pos          29UL
#define I3C_CORE_DEVICE_CTRL_ABORT_Msk          0x20000000UL
#define I3C_CORE_DEVICE_CTRL_RESUME_Pos         30UL
#define I3C_CORE_DEVICE_CTRL_RESUME_Msk         0x40000000UL
#define I3C_CORE_DEVICE_CTRL_ENABLE_Pos         31UL
#define I3C_CORE_DEVICE_CTRL_ENABLE_Msk         0x80000000UL
/* I3C_CORE.DEVICE_ADDR */
#define I3C_CORE_DEVICE_ADDR_STATIC_ADDR_Pos    0UL
#define I3C_CORE_DEVICE_ADDR_STATIC_ADDR_Msk    0x7FUL
#define I3C_CORE_DEVICE_ADDR_STATIC_ADDR_VALID_Pos 15UL
#define I3C_CORE_DEVICE_ADDR_STATIC_ADDR_VALID_Msk 0x8000UL
#define I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_Pos   16UL
#define I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_Msk   0x7F0000UL
#define I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_VALID_Pos 31UL
#define I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_VALID_Msk 0x80000000UL
/* I3C_CORE.COMMAND_QUEUE_PORT */
#define I3C_CORE_COMMAND_QUEUE_PORT_COMMAND_Pos 0UL
#define I3C_CORE_COMMAND_QUEUE_PORT_COMMAND_Msk 0xFFFFFFFFUL
/* I3C_CORE.RESPONSE_QUEUE_PORT */
#define I3C_CORE_RESPONSE_QUEUE_PORT_RESPONSE_Pos 0UL
#define I3C_CORE_RESPONSE_QUEUE_PORT_RESPONSE_Msk 0xFFFFFFFFUL
/* I3C_CORE.TX_RX_DATA_PORT */
#define I3C_CORE_TX_RX_DATA_PORT_TX_RX_DATA_PORT_Pos 0UL
#define I3C_CORE_TX_RX_DATA_PORT_TX_RX_DATA_PORT_Msk 0xFFFFFFFFUL
/* I3C_CORE.IBI_QUEUE_DATA */
#define I3C_CORE_IBI_QUEUE_DATA_IBI_DATA_Pos    0UL
#define I3C_CORE_IBI_QUEUE_DATA_IBI_DATA_Msk    0xFFFFFFFFUL
/* I3C_CORE.QUEUE_THLD_CTRL */
#define I3C_CORE_QUEUE_THLD_CTRL_CMD_EMPTY_BUF_THLD_Pos 0UL
#define I3C_CORE_QUEUE_THLD_CTRL_CMD_EMPTY_BUF_THLD_Msk 0xFFUL
#define I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD_Pos 8UL
#define I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD_Msk 0xFF00UL
#define I3C_CORE_QUEUE_THLD_CTRL_IBI_DATA_THLD_Pos 16UL
#define I3C_CORE_QUEUE_THLD_CTRL_IBI_DATA_THLD_Msk 0xFF0000UL
#define I3C_CORE_QUEUE_THLD_CTRL_IBI_STATUS_THLD_Pos 24UL
#define I3C_CORE_QUEUE_THLD_CTRL_IBI_STATUS_THLD_Msk 0xFF000000UL
/* I3C_CORE.DATA_BUFFER_THLD_CTRL */
#define I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_EMPTY_BUF_THLD_Pos 0UL
#define I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_EMPTY_BUF_THLD_Msk 0x7UL
#define I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD_Pos 8UL
#define I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD_Msk 0x700UL
#define I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_START_THLD_Pos 16UL
#define I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_START_THLD_Msk 0x70000UL
#define I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_START_THLD_Pos 24UL
#define I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_START_THLD_Msk 0x7000000UL
/* I3C_CORE.IBI_QUEUE_CTRL */
#define I3C_CORE_IBI_QUEUE_CTRL_NOTIFY_HJ_REJECTED_Pos 0UL
#define I3C_CORE_IBI_QUEUE_CTRL_NOTIFY_HJ_REJECTED_Msk 0x1UL
#define I3C_CORE_IBI_QUEUE_CTRL_NOTIFY_CR_REJECTED_Pos 1UL
#define I3C_CORE_IBI_QUEUE_CTRL_NOTIFY_CR_REJECTED_Msk 0x2UL
#define I3C_CORE_IBI_QUEUE_CTRL_NOTIFY_TIR_REJECTED_Pos 3UL
#define I3C_CORE_IBI_QUEUE_CTRL_NOTIFY_TIR_REJECTED_Msk 0x8UL
/* I3C_CORE.RESET_CTRL */
#define I3C_CORE_RESET_CTRL_SOFT_RST_Pos        0UL
#define I3C_CORE_RESET_CTRL_SOFT_RST_Msk        0x1UL
#define I3C_CORE_RESET_CTRL_CMD_QUEUE_RST_Pos   1UL
#define I3C_CORE_RESET_CTRL_CMD_QUEUE_RST_Msk   0x2UL
#define I3C_CORE_RESET_CTRL_RESP_QUEUE_RST_Pos  2UL
#define I3C_CORE_RESET_CTRL_RESP_QUEUE_RST_Msk  0x4UL
#define I3C_CORE_RESET_CTRL_TX_FIFO_RST_Pos     3UL
#define I3C_CORE_RESET_CTRL_TX_FIFO_RST_Msk     0x8UL
#define I3C_CORE_RESET_CTRL_RX_FIFO_RST_Pos     4UL
#define I3C_CORE_RESET_CTRL_RX_FIFO_RST_Msk     0x10UL
#define I3C_CORE_RESET_CTRL_IBI_QUEUE_RST_Pos   5UL
#define I3C_CORE_RESET_CTRL_IBI_QUEUE_RST_Msk   0x20UL
#define I3C_CORE_RESET_CTRL_BUS_RESET_TYPE_Pos  28UL
#define I3C_CORE_RESET_CTRL_BUS_RESET_TYPE_Msk  0x70000000UL
#define I3C_CORE_RESET_CTRL_BUS_RESET_Pos       31UL
#define I3C_CORE_RESET_CTRL_BUS_RESET_Msk       0x80000000UL
/* I3C_CORE.TGT_EVENT_STATUS */
#define I3C_CORE_TGT_EVENT_STATUS_TIR_EN_Pos    0UL
#define I3C_CORE_TGT_EVENT_STATUS_TIR_EN_Msk    0x1UL
#define I3C_CORE_TGT_EVENT_STATUS_CR_EN_Pos     1UL
#define I3C_CORE_TGT_EVENT_STATUS_CR_EN_Msk     0x2UL
#define I3C_CORE_TGT_EVENT_STATUS_HJ_EN_Pos     3UL
#define I3C_CORE_TGT_EVENT_STATUS_HJ_EN_Msk     0x8UL
#define I3C_CORE_TGT_EVENT_STATUS_ACTIVITY_STATE_Pos 4UL
#define I3C_CORE_TGT_EVENT_STATUS_ACTIVITY_STATE_Msk 0x30UL
#define I3C_CORE_TGT_EVENT_STATUS_MRL_UPDATED_Pos 6UL
#define I3C_CORE_TGT_EVENT_STATUS_MRL_UPDATED_Msk 0x40UL
#define I3C_CORE_TGT_EVENT_STATUS_MWL_UPDATED_Pos 7UL
#define I3C_CORE_TGT_EVENT_STATUS_MWL_UPDATED_Msk 0x80UL
/* I3C_CORE.INTR_STATUS */
#define I3C_CORE_INTR_STATUS_TX_THLD_STS_Pos    0UL
#define I3C_CORE_INTR_STATUS_TX_THLD_STS_Msk    0x1UL
#define I3C_CORE_INTR_STATUS_RX_THLD_STS_Pos    1UL
#define I3C_CORE_INTR_STATUS_RX_THLD_STS_Msk    0x2UL
#define I3C_CORE_INTR_STATUS_IBI_THLD_STS_Pos   2UL
#define I3C_CORE_INTR_STATUS_IBI_THLD_STS_Msk   0x4UL
#define I3C_CORE_INTR_STATUS_CMD_QUEUE_READY_STS_Pos 3UL
#define I3C_CORE_INTR_STATUS_CMD_QUEUE_READY_STS_Msk 0x8UL
#define I3C_CORE_INTR_STATUS_RESP_READY_STS_Pos 4UL
#define I3C_CORE_INTR_STATUS_RESP_READY_STS_Msk 0x10UL
#define I3C_CORE_INTR_STATUS_TRANSFER_ABORT_STS_Pos 5UL
#define I3C_CORE_INTR_STATUS_TRANSFER_ABORT_STS_Msk 0x20UL
#define I3C_CORE_INTR_STATUS_CCC_UPDATED_STS_Pos 6UL
#define I3C_CORE_INTR_STATUS_CCC_UPDATED_STS_Msk 0x40UL
#define I3C_CORE_INTR_STATUS_DYN_ADDR_ASSGN_STS_Pos 8UL
#define I3C_CORE_INTR_STATUS_DYN_ADDR_ASSGN_STS_Msk 0x100UL
#define I3C_CORE_INTR_STATUS_TRANSFER_ERR_STS_Pos 9UL
#define I3C_CORE_INTR_STATUS_TRANSFER_ERR_STS_Msk 0x200UL
#define I3C_CORE_INTR_STATUS_DEFTGT_STS_Pos     10UL
#define I3C_CORE_INTR_STATUS_DEFTGT_STS_Msk     0x400UL
#define I3C_CORE_INTR_STATUS_READ_REQ_RECV_STS_Pos 11UL
#define I3C_CORE_INTR_STATUS_READ_REQ_RECV_STS_Msk 0x800UL
#define I3C_CORE_INTR_STATUS_IBI_UPDATED_STS_Pos 12UL
#define I3C_CORE_INTR_STATUS_IBI_UPDATED_STS_Msk 0x1000UL
#define I3C_CORE_INTR_STATUS_BUSOWNER_UPDATED_STS_Pos 13UL
#define I3C_CORE_INTR_STATUS_BUSOWNER_UPDATED_STS_Msk 0x2000UL
#define I3C_CORE_INTR_STATUS_BUS_RESET_DONE_STS_Pos 15UL
#define I3C_CORE_INTR_STATUS_BUS_RESET_DONE_STS_Msk 0x8000UL
#define I3C_CORE_INTR_STATUS_START_DET_STS_Pos  16UL
#define I3C_CORE_INTR_STATUS_START_DET_STS_Msk  0x10000UL
#define I3C_CORE_INTR_STATUS_TGT_RST_PATTERN_DET_STS_Pos 17UL
#define I3C_CORE_INTR_STATUS_TGT_RST_PATTERN_DET_STS_Msk 0x20000UL
#define I3C_CORE_INTR_STATUS_SDA_RELEASED_STS_Pos 19UL
#define I3C_CORE_INTR_STATUS_SDA_RELEASED_STS_Msk 0x80000UL
#define I3C_CORE_INTR_STATUS_EXT_CMD_SENT_STS_Pos 20UL
#define I3C_CORE_INTR_STATUS_EXT_CMD_SENT_STS_Msk 0x100000UL
/* I3C_CORE.INTR_STATUS_EN */
#define I3C_CORE_INTR_STATUS_EN_TX_THLD_STS_EN_Pos 0UL
#define I3C_CORE_INTR_STATUS_EN_TX_THLD_STS_EN_Msk 0x1UL
#define I3C_CORE_INTR_STATUS_EN_RX_THLD_STS_EN_Pos 1UL
#define I3C_CORE_INTR_STATUS_EN_RX_THLD_STS_EN_Msk 0x2UL
#define I3C_CORE_INTR_STATUS_EN_IBI_THLD_STS_EN_Pos 2UL
#define I3C_CORE_INTR_STATUS_EN_IBI_THLD_STS_EN_Msk 0x4UL
#define I3C_CORE_INTR_STATUS_EN_CMD_QUEUE_READY_STS_EN_Pos 3UL
#define I3C_CORE_INTR_STATUS_EN_CMD_QUEUE_READY_STS_EN_Msk 0x8UL
#define I3C_CORE_INTR_STATUS_EN_RESP_READY_STS_EN_Pos 4UL
#define I3C_CORE_INTR_STATUS_EN_RESP_READY_STS_EN_Msk 0x10UL
#define I3C_CORE_INTR_STATUS_EN_TRANSFER_ABORT_STS_EN_Pos 5UL
#define I3C_CORE_INTR_STATUS_EN_TRANSFER_ABORT_STS_EN_Msk 0x20UL
#define I3C_CORE_INTR_STATUS_EN_CCC_UPDATED_STS_EN_Pos 6UL
#define I3C_CORE_INTR_STATUS_EN_CCC_UPDATED_STS_EN_Msk 0x40UL
#define I3C_CORE_INTR_STATUS_EN_DYN_ADDR_ASSGN_STS_EN_Pos 8UL
#define I3C_CORE_INTR_STATUS_EN_DYN_ADDR_ASSGN_STS_EN_Msk 0x100UL
#define I3C_CORE_INTR_STATUS_EN_TRANSFER_ERR_STS_EN_Pos 9UL
#define I3C_CORE_INTR_STATUS_EN_TRANSFER_ERR_STS_EN_Msk 0x200UL
#define I3C_CORE_INTR_STATUS_EN_DEFTGT_STS_EN_Pos 10UL
#define I3C_CORE_INTR_STATUS_EN_DEFTGT_STS_EN_Msk 0x400UL
#define I3C_CORE_INTR_STATUS_EN_READ_REQ_RECV_STS_EN_Pos 11UL
#define I3C_CORE_INTR_STATUS_EN_READ_REQ_RECV_STS_EN_Msk 0x800UL
#define I3C_CORE_INTR_STATUS_EN_IBI_UPDATED_STS_EN_Pos 12UL
#define I3C_CORE_INTR_STATUS_EN_IBI_UPDATED_STS_EN_Msk 0x1000UL
#define I3C_CORE_INTR_STATUS_EN_BUSOWNER_UPDATED_STS_EN_Pos 13UL
#define I3C_CORE_INTR_STATUS_EN_BUSOWNER_UPDATED_STS_EN_Msk 0x2000UL
#define I3C_CORE_INTR_STATUS_EN_BUS_RESET_DONE_STS_EN_Pos 15UL
#define I3C_CORE_INTR_STATUS_EN_BUS_RESET_DONE_STS_EN_Msk 0x8000UL
#define I3C_CORE_INTR_STATUS_EN_START_DET_STS_EN_Pos 16UL
#define I3C_CORE_INTR_STATUS_EN_START_DET_STS_EN_Msk 0x10000UL
#define I3C_CORE_INTR_STATUS_EN_TGT_RST_PATTERN_DET_STS_EN_Pos 17UL
#define I3C_CORE_INTR_STATUS_EN_TGT_RST_PATTERN_DET_STS_EN_Msk 0x20000UL
#define I3C_CORE_INTR_STATUS_EN_SDA_RELEASED_STS_EN_Pos 19UL
#define I3C_CORE_INTR_STATUS_EN_SDA_RELEASED_STS_EN_Msk 0x80000UL
#define I3C_CORE_INTR_STATUS_EN_EXT_CMD_SENT_STS_EN_Pos 20UL
#define I3C_CORE_INTR_STATUS_EN_EXT_CMD_SENT_STS_EN_Msk 0x100000UL
/* I3C_CORE.INTR_SIGNAL_EN */
#define I3C_CORE_INTR_SIGNAL_EN_TX_THLD_SIGNAL_EN_Pos 0UL
#define I3C_CORE_INTR_SIGNAL_EN_TX_THLD_SIGNAL_EN_Msk 0x1UL
#define I3C_CORE_INTR_SIGNAL_EN_RX_THLD_SIGNAL_EN_Pos 1UL
#define I3C_CORE_INTR_SIGNAL_EN_RX_THLD_SIGNAL_EN_Msk 0x2UL
#define I3C_CORE_INTR_SIGNAL_EN_IBI_THLD_SIGNAL_EN_Pos 2UL
#define I3C_CORE_INTR_SIGNAL_EN_IBI_THLD_SIGNAL_EN_Msk 0x4UL
#define I3C_CORE_INTR_SIGNAL_EN_CMD_QUEUE_READY_SIGNAL_EN_Pos 3UL
#define I3C_CORE_INTR_SIGNAL_EN_CMD_QUEUE_READY_SIGNAL_EN_Msk 0x8UL
#define I3C_CORE_INTR_SIGNAL_EN_RESP_READY_SIGNAL_EN_Pos 4UL
#define I3C_CORE_INTR_SIGNAL_EN_RESP_READY_SIGNAL_EN_Msk 0x10UL
#define I3C_CORE_INTR_SIGNAL_EN_TRANSFER_ABORT_SIGNAL_EN_Pos 5UL
#define I3C_CORE_INTR_SIGNAL_EN_TRANSFER_ABORT_SIGNAL_EN_Msk 0x20UL
#define I3C_CORE_INTR_SIGNAL_EN_CCC_UPDATED_SIGNAL_EN_Pos 6UL
#define I3C_CORE_INTR_SIGNAL_EN_CCC_UPDATED_SIGNAL_EN_Msk 0x40UL
#define I3C_CORE_INTR_SIGNAL_EN_DYN_ADDR_ASSGN_SIGNAL_EN_Pos 8UL
#define I3C_CORE_INTR_SIGNAL_EN_DYN_ADDR_ASSGN_SIGNAL_EN_Msk 0x100UL
#define I3C_CORE_INTR_SIGNAL_EN_TRANSFER_ERR_SIGNAL_EN_Pos 9UL
#define I3C_CORE_INTR_SIGNAL_EN_TRANSFER_ERR_SIGNAL_EN_Msk 0x200UL
#define I3C_CORE_INTR_SIGNAL_EN_DEFTGT_SIGNAL_EN_Pos 10UL
#define I3C_CORE_INTR_SIGNAL_EN_DEFTGT_SIGNAL_EN_Msk 0x400UL
#define I3C_CORE_INTR_SIGNAL_EN_READ_REQ_RECV_SIGNAL_EN_Pos 11UL
#define I3C_CORE_INTR_SIGNAL_EN_READ_REQ_RECV_SIGNAL_EN_Msk 0x800UL
#define I3C_CORE_INTR_SIGNAL_EN_IBI_UPDATED_SIGNAL_EN_Pos 12UL
#define I3C_CORE_INTR_SIGNAL_EN_IBI_UPDATED_SIGNAL_EN_Msk 0x1000UL
#define I3C_CORE_INTR_SIGNAL_EN_BUSOWNER_UPDATED_SIGNAL_EN_Pos 13UL
#define I3C_CORE_INTR_SIGNAL_EN_BUSOWNER_UPDATED_SIGNAL_EN_Msk 0x2000UL
#define I3C_CORE_INTR_SIGNAL_EN_BUS_RESET_DONE_SIGNAL_EN_Pos 15UL
#define I3C_CORE_INTR_SIGNAL_EN_BUS_RESET_DONE_SIGNAL_EN_Msk 0x8000UL
#define I3C_CORE_INTR_SIGNAL_EN_START_DET_SIGNAL_EN_Pos 16UL
#define I3C_CORE_INTR_SIGNAL_EN_START_DET_SIGNAL_EN_Msk 0x10000UL
#define I3C_CORE_INTR_SIGNAL_EN_TGT_RST_PATTERN_DET_SIGNAL_EN_Pos 17UL
#define I3C_CORE_INTR_SIGNAL_EN_TGT_RST_PATTERN_DET_SIGNAL_EN_Msk 0x20000UL
#define I3C_CORE_INTR_SIGNAL_EN_SDA_RELEASED_SIGNAL_EN_Pos 19UL
#define I3C_CORE_INTR_SIGNAL_EN_SDA_RELEASED_SIGNAL_EN_Msk 0x80000UL
#define I3C_CORE_INTR_SIGNAL_EN_EXT_CMD_SENT_SIGNAL_EN_Pos 20UL
#define I3C_CORE_INTR_SIGNAL_EN_EXT_CMD_SENT_SIGNAL_EN_Msk 0x100000UL
/* I3C_CORE.INTR_FORCE */
#define I3C_CORE_INTR_FORCE_TX_THLD_FORCE_EN_Pos 0UL
#define I3C_CORE_INTR_FORCE_TX_THLD_FORCE_EN_Msk 0x1UL
#define I3C_CORE_INTR_FORCE_RX_THLD_FORCE_EN_Pos 1UL
#define I3C_CORE_INTR_FORCE_RX_THLD_FORCE_EN_Msk 0x2UL
#define I3C_CORE_INTR_FORCE_IBI_THLD_FORCE_EN_Pos 2UL
#define I3C_CORE_INTR_FORCE_IBI_THLD_FORCE_EN_Msk 0x4UL
#define I3C_CORE_INTR_FORCE_CMD_QUEUE_READY_FORCE_EN_Pos 3UL
#define I3C_CORE_INTR_FORCE_CMD_QUEUE_READY_FORCE_EN_Msk 0x8UL
#define I3C_CORE_INTR_FORCE_RESP_READY_FORCE_EN_Pos 4UL
#define I3C_CORE_INTR_FORCE_RESP_READY_FORCE_EN_Msk 0x10UL
#define I3C_CORE_INTR_FORCE_TRANSFER_ABORT_FORCE_EN_Pos 5UL
#define I3C_CORE_INTR_FORCE_TRANSFER_ABORT_FORCE_EN_Msk 0x20UL
#define I3C_CORE_INTR_FORCE_CCC_UPDATED_FORCE_EN_Pos 6UL
#define I3C_CORE_INTR_FORCE_CCC_UPDATED_FORCE_EN_Msk 0x40UL
#define I3C_CORE_INTR_FORCE_DYN_ADDR_ASSGN_FORCE_EN_Pos 8UL
#define I3C_CORE_INTR_FORCE_DYN_ADDR_ASSGN_FORCE_EN_Msk 0x100UL
#define I3C_CORE_INTR_FORCE_TRANSFER_ERR_FORCE_EN_Pos 9UL
#define I3C_CORE_INTR_FORCE_TRANSFER_ERR_FORCE_EN_Msk 0x200UL
#define I3C_CORE_INTR_FORCE_DEFTGT_FORCE_EN_Pos 10UL
#define I3C_CORE_INTR_FORCE_DEFTGT_FORCE_EN_Msk 0x400UL
#define I3C_CORE_INTR_FORCE_READ_REQ_FORCE_EN_Pos 11UL
#define I3C_CORE_INTR_FORCE_READ_REQ_FORCE_EN_Msk 0x800UL
#define I3C_CORE_INTR_FORCE_IBI_UPDATED_FORCE_EN_Pos 12UL
#define I3C_CORE_INTR_FORCE_IBI_UPDATED_FORCE_EN_Msk 0x1000UL
#define I3C_CORE_INTR_FORCE_BUSOWNER_UPDATED_FORCE_EN_Pos 13UL
#define I3C_CORE_INTR_FORCE_BUSOWNER_UPDATED_FORCE_EN_Msk 0x2000UL
#define I3C_CORE_INTR_FORCE_BUS_RESET_DONE_FORCE_EN_Pos 15UL
#define I3C_CORE_INTR_FORCE_BUS_RESET_DONE_FORCE_EN_Msk 0x8000UL
#define I3C_CORE_INTR_FORCE_START_DET_FORCE_EN_Pos 16UL
#define I3C_CORE_INTR_FORCE_START_DET_FORCE_EN_Msk 0x10000UL
#define I3C_CORE_INTR_FORCE_TGT_RST_PATTERN_DET_FORCE_EN_Pos 17UL
#define I3C_CORE_INTR_FORCE_TGT_RST_PATTERN_DET_FORCE_EN_Msk 0x20000UL
#define I3C_CORE_INTR_FORCE_SDA_RELEASED_FORCE_EN_Pos 19UL
#define I3C_CORE_INTR_FORCE_SDA_RELEASED_FORCE_EN_Msk 0x80000UL
#define I3C_CORE_INTR_FORCE_EXT_CMD_SENT_FORCE_EN_Pos 20UL
#define I3C_CORE_INTR_FORCE_EXT_CMD_SENT_FORCE_EN_Msk 0x100000UL
/* I3C_CORE.QUEUE_STATUS_LEVEL */
#define I3C_CORE_QUEUE_STATUS_LEVEL_CMD_QUEUE_EMPTY_LOC_Pos 0UL
#define I3C_CORE_QUEUE_STATUS_LEVEL_CMD_QUEUE_EMPTY_LOC_Msk 0xFFUL
#define I3C_CORE_QUEUE_STATUS_LEVEL_RESP_BUF_BLR_Pos 8UL
#define I3C_CORE_QUEUE_STATUS_LEVEL_RESP_BUF_BLR_Msk 0xFF00UL
#define I3C_CORE_QUEUE_STATUS_LEVEL_IBI_BUF_BLR_Pos 16UL
#define I3C_CORE_QUEUE_STATUS_LEVEL_IBI_BUF_BLR_Msk 0xFF0000UL
#define I3C_CORE_QUEUE_STATUS_LEVEL_IBI_STS_CNT_Pos 24UL
#define I3C_CORE_QUEUE_STATUS_LEVEL_IBI_STS_CNT_Msk 0x1F000000UL
/* I3C_CORE.DATA_BUFFER_STATUS_LEVEL */
#define I3C_CORE_DATA_BUFFER_STATUS_LEVEL_TX_BUF_EMPTY_LOC_Pos 0UL
#define I3C_CORE_DATA_BUFFER_STATUS_LEVEL_TX_BUF_EMPTY_LOC_Msk 0xFFUL
#define I3C_CORE_DATA_BUFFER_STATUS_LEVEL_RX_BUF_BLR_Pos 16UL
#define I3C_CORE_DATA_BUFFER_STATUS_LEVEL_RX_BUF_BLR_Msk 0xFF0000UL
/* I3C_CORE.PRESENT_STATE */
#define I3C_CORE_PRESENT_STATE_SCL_LINE_SIGNAL_LEVEL_Pos 0UL
#define I3C_CORE_PRESENT_STATE_SCL_LINE_SIGNAL_LEVEL_Msk 0x1UL
#define I3C_CORE_PRESENT_STATE_SDA_LINE_SIGNAL_LEVEL_Pos 1UL
#define I3C_CORE_PRESENT_STATE_SDA_LINE_SIGNAL_LEVEL_Msk 0x2UL
#define I3C_CORE_PRESENT_STATE_ACTIVE_CONTROLLER_Pos 2UL
#define I3C_CORE_PRESENT_STATE_ACTIVE_CONTROLLER_Msk 0x4UL
#define I3C_CORE_PRESENT_STATE_CM_TFR_STS_Pos   8UL
#define I3C_CORE_PRESENT_STATE_CM_TFR_STS_Msk   0x3F00UL
#define I3C_CORE_PRESENT_STATE_CM_TFR_ST_STS_Pos 16UL
#define I3C_CORE_PRESENT_STATE_CM_TFR_ST_STS_Msk 0x3F0000UL
#define I3C_CORE_PRESENT_STATE_CMD_TID_Pos      24UL
#define I3C_CORE_PRESENT_STATE_CMD_TID_Msk      0xF000000UL
#define I3C_CORE_PRESENT_STATE_CONTROLLER_IDLE_Pos 28UL
#define I3C_CORE_PRESENT_STATE_CONTROLLER_IDLE_Msk 0x10000000UL
/* I3C_CORE.CCC_DEVICE_STATUS */
#define I3C_CORE_CCC_DEVICE_STATUS_PENDING_INTR_Pos 0UL
#define I3C_CORE_CCC_DEVICE_STATUS_PENDING_INTR_Msk 0xFUL
#define I3C_CORE_CCC_DEVICE_STATUS_PROTOCOL_ERR_Pos 5UL
#define I3C_CORE_CCC_DEVICE_STATUS_PROTOCOL_ERR_Msk 0x20UL
#define I3C_CORE_CCC_DEVICE_STATUS_ACTIVITY_MODE_Pos 6UL
#define I3C_CORE_CCC_DEVICE_STATUS_ACTIVITY_MODE_Msk 0xC0UL
#define I3C_CORE_CCC_DEVICE_STATUS_UNDERFLOW_ERR_Pos 8UL
#define I3C_CORE_CCC_DEVICE_STATUS_UNDERFLOW_ERR_Msk 0x100UL
#define I3C_CORE_CCC_DEVICE_STATUS_TARGET_BUSY_Pos 9UL
#define I3C_CORE_CCC_DEVICE_STATUS_TARGET_BUSY_Msk 0x200UL
#define I3C_CORE_CCC_DEVICE_STATUS_OVERFLOW_ERR_Pos 10UL
#define I3C_CORE_CCC_DEVICE_STATUS_OVERFLOW_ERR_Msk 0x400UL
#define I3C_CORE_CCC_DEVICE_STATUS_DATA_NOT_READY_Pos 11UL
#define I3C_CORE_CCC_DEVICE_STATUS_DATA_NOT_READY_Msk 0x800UL
#define I3C_CORE_CCC_DEVICE_STATUS_BUFFER_NOT_AVAIL_Pos 12UL
#define I3C_CORE_CCC_DEVICE_STATUS_BUFFER_NOT_AVAIL_Msk 0x1000UL
#define I3C_CORE_CCC_DEVICE_STATUS_FRAME_ERROR_Pos 13UL
#define I3C_CORE_CCC_DEVICE_STATUS_FRAME_ERROR_Msk 0x2000UL
/* I3C_CORE.DEVICE_ADDR_TABLE_POINTER */
#define I3C_CORE_DEVICE_ADDR_TABLE_POINTER_P_DEV_ADDR_TABLE_START_ADDR_Pos 0UL
#define I3C_CORE_DEVICE_ADDR_TABLE_POINTER_P_DEV_ADDR_TABLE_START_ADDR_Msk 0xFFFFUL
#define I3C_CORE_DEVICE_ADDR_TABLE_POINTER_DEV_ADDR_TABLE_DEPTH_Pos 16UL
#define I3C_CORE_DEVICE_ADDR_TABLE_POINTER_DEV_ADDR_TABLE_DEPTH_Msk 0xFFFF0000UL
/* I3C_CORE.DEV_CHAR_TABLE_POINTER */
#define I3C_CORE_DEV_CHAR_TABLE_POINTER_P_DEV_CHAR_TABLE_START_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE_POINTER_P_DEV_CHAR_TABLE_START_ADDR_Msk 0xFFFUL
#define I3C_CORE_DEV_CHAR_TABLE_POINTER_DEV_CHAR_TABLE_DEPTH_Pos 12UL
#define I3C_CORE_DEV_CHAR_TABLE_POINTER_DEV_CHAR_TABLE_DEPTH_Msk 0x7F000UL
#define I3C_CORE_DEV_CHAR_TABLE_POINTER_PRESENT_DEV_CHAR_TABLE_INDX_Pos 19UL
#define I3C_CORE_DEV_CHAR_TABLE_POINTER_PRESENT_DEV_CHAR_TABLE_INDX_Msk 0x780000UL
/* I3C_CORE.VENDOR_SPECIFIC_REG_POINTER */
#define I3C_CORE_VENDOR_SPECIFIC_REG_POINTER_P_VENDOR_REG_START_ADDR_Pos 0UL
#define I3C_CORE_VENDOR_SPECIFIC_REG_POINTER_P_VENDOR_REG_START_ADDR_Msk 0xFFFFUL
/* I3C_CORE.TGT_MIPI_ID_VALUE */
#define I3C_CORE_TGT_MIPI_ID_VALUE_TGT_PROV_ID_SEL_Pos 0UL
#define I3C_CORE_TGT_MIPI_ID_VALUE_TGT_PROV_ID_SEL_Msk 0x1UL
#define I3C_CORE_TGT_MIPI_ID_VALUE_TGT_MIPI_MFG_ID_Pos 1UL
#define I3C_CORE_TGT_MIPI_ID_VALUE_TGT_MIPI_MFG_ID_Msk 0xFFFEUL
/* I3C_CORE.TGT_PID_VALUE */
#define I3C_CORE_TGT_PID_VALUE_TGT_PID_DCR_Pos  0UL
#define I3C_CORE_TGT_PID_VALUE_TGT_PID_DCR_Msk  0xFFFUL
#define I3C_CORE_TGT_PID_VALUE_TGT_INST_ID_Pos  12UL
#define I3C_CORE_TGT_PID_VALUE_TGT_INST_ID_Msk  0xF000UL
#define I3C_CORE_TGT_PID_VALUE_TGT_PART_ID_Pos  16UL
#define I3C_CORE_TGT_PID_VALUE_TGT_PART_ID_Msk  0xFFFF0000UL
/* I3C_CORE.TGT_CHAR_CTRL */
#define I3C_CORE_TGT_CHAR_CTRL_MAX_DATA_SPEED_LIMIT_Pos 0UL
#define I3C_CORE_TGT_CHAR_CTRL_MAX_DATA_SPEED_LIMIT_Msk 0x1UL
#define I3C_CORE_TGT_CHAR_CTRL_IBI_REQUEST_CAPABLE_Pos 1UL
#define I3C_CORE_TGT_CHAR_CTRL_IBI_REQUEST_CAPABLE_Msk 0x2UL
#define I3C_CORE_TGT_CHAR_CTRL_IBI_PAYLOAD_Pos  2UL
#define I3C_CORE_TGT_CHAR_CTRL_IBI_PAYLOAD_Msk  0x4UL
#define I3C_CORE_TGT_CHAR_CTRL_OFFLINE_CAPABLE_Pos 3UL
#define I3C_CORE_TGT_CHAR_CTRL_OFFLINE_CAPABLE_Msk 0x8UL
#define I3C_CORE_TGT_CHAR_CTRL_BRIDGE_IDENTIFIER_Pos 4UL
#define I3C_CORE_TGT_CHAR_CTRL_BRIDGE_IDENTIFIER_Msk 0x10UL
#define I3C_CORE_TGT_CHAR_CTRL_HDR_CAPABLE_Pos  5UL
#define I3C_CORE_TGT_CHAR_CTRL_HDR_CAPABLE_Msk  0x20UL
#define I3C_CORE_TGT_CHAR_CTRL_DEVICE_ROLE_Pos  6UL
#define I3C_CORE_TGT_CHAR_CTRL_DEVICE_ROLE_Msk  0xC0UL
#define I3C_CORE_TGT_CHAR_CTRL_DCR_Pos          8UL
#define I3C_CORE_TGT_CHAR_CTRL_DCR_Msk          0xFF00UL
#define I3C_CORE_TGT_CHAR_CTRL_HDR_CAP_Pos      16UL
#define I3C_CORE_TGT_CHAR_CTRL_HDR_CAP_Msk      0xFF0000UL
/* I3C_CORE.TGT_MAX_LEN */
#define I3C_CORE_TGT_MAX_LEN_MWL_Pos            0UL
#define I3C_CORE_TGT_MAX_LEN_MWL_Msk            0xFFFFUL
#define I3C_CORE_TGT_MAX_LEN_MRL_Pos            16UL
#define I3C_CORE_TGT_MAX_LEN_MRL_Msk            0xFFFF0000UL
/* I3C_CORE.MAX_READ_TURNAROUND */
#define I3C_CORE_MAX_READ_TURNAROUND_MXDS_MAX_RD_TURN_Pos 0UL
#define I3C_CORE_MAX_READ_TURNAROUND_MXDS_MAX_RD_TURN_Msk 0xFFFFFFUL
/* I3C_CORE.MAX_DATA_SPEED */
#define I3C_CORE_MAX_DATA_SPEED_MXDS_MAX_WR_SPEED_Pos 0UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_MAX_WR_SPEED_Msk 0x7UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_DEF_BYTE_SUPPORT_Pos 3UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_DEF_BYTE_SUPPORT_Msk 0x8UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_MAX_RD_SPEED_Pos 8UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_MAX_RD_SPEED_Msk 0x700UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_CLK_DATA_TURN_Pos 16UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_CLK_DATA_TURN_Msk 0x70000UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_STOP_PERMIT_Pos 19UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_STOP_PERMIT_Msk 0x80000UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_ACTIVITY_STATE_Pos 24UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_ACTIVITY_STATE_Msk 0x3000000UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_SET_ACTIVITY_STATE_Pos 26UL
#define I3C_CORE_MAX_DATA_SPEED_MXDS_SET_ACTIVITY_STATE_Msk 0x4000000UL
/* I3C_CORE.TGT_INTR_REQ */
#define I3C_CORE_TGT_INTR_REQ_TIR_Pos           0UL
#define I3C_CORE_TGT_INTR_REQ_TIR_Msk           0x1UL
#define I3C_CORE_TGT_INTR_REQ_TIR_CTRL_Pos      1UL
#define I3C_CORE_TGT_INTR_REQ_TIR_CTRL_Msk      0x6UL
#define I3C_CORE_TGT_INTR_REQ_CR_Pos            3UL
#define I3C_CORE_TGT_INTR_REQ_CR_Msk            0x8UL
#define I3C_CORE_TGT_INTR_REQ_TS_Pos            4UL
#define I3C_CORE_TGT_INTR_REQ_TS_Msk            0x10UL
#define I3C_CORE_TGT_INTR_REQ_CE3_RECOVERY_Pos  7UL
#define I3C_CORE_TGT_INTR_REQ_CE3_RECOVERY_Msk  0x80UL
#define I3C_CORE_TGT_INTR_REQ_MDB_Pos           8UL
#define I3C_CORE_TGT_INTR_REQ_MDB_Msk           0xFF00UL
#define I3C_CORE_TGT_INTR_REQ_TIR_DATA_LENGTH_Pos 16UL
#define I3C_CORE_TGT_INTR_REQ_TIR_DATA_LENGTH_Msk 0xFF0000UL
/* I3C_CORE.TGT_TIR_DATA */
#define I3C_CORE_TGT_TIR_DATA_TIR_DATA_BYTE0_Pos 0UL
#define I3C_CORE_TGT_TIR_DATA_TIR_DATA_BYTE0_Msk 0xFFUL
#define I3C_CORE_TGT_TIR_DATA_TIR_DATA_BYTE1_Pos 8UL
#define I3C_CORE_TGT_TIR_DATA_TIR_DATA_BYTE1_Msk 0xFF00UL
#define I3C_CORE_TGT_TIR_DATA_TIR_DATA_BYTE2_Pos 16UL
#define I3C_CORE_TGT_TIR_DATA_TIR_DATA_BYTE2_Msk 0xFF0000UL
#define I3C_CORE_TGT_TIR_DATA_TIR_DATA_BYTE3_Pos 24UL
#define I3C_CORE_TGT_TIR_DATA_TIR_DATA_BYTE3_Msk 0xFF000000UL
/* I3C_CORE.TGT_IBI_RESP */
#define I3C_CORE_TGT_IBI_RESP_IBI_STS_Pos       0UL
#define I3C_CORE_TGT_IBI_RESP_IBI_STS_Msk       0x3UL
#define I3C_CORE_TGT_IBI_RESP_TIR_RESP_DATA_LENGTH_Pos 8UL
#define I3C_CORE_TGT_IBI_RESP_TIR_RESP_DATA_LENGTH_Msk 0xFFFF00UL
/* I3C_CORE.DEVICE_CTRL_EXTENDED */
#define I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_Pos 0UL
#define I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_Msk 0x3UL
#define I3C_CORE_DEVICE_CTRL_EXTENDED_GETACCCR_ACK_CTRL_Pos 3UL
#define I3C_CORE_DEVICE_CTRL_EXTENDED_GETACCCR_ACK_CTRL_Msk 0x8UL
#define I3C_CORE_DEVICE_CTRL_EXTENDED_DEEP_SLEEP_CAP_Pos 4UL
#define I3C_CORE_DEVICE_CTRL_EXTENDED_DEEP_SLEEP_CAP_Msk 0x10UL
/* I3C_CORE.SCL_I3C_OD_TIMING */
#define I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_LCNT_Pos 0UL
#define I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_LCNT_Msk 0xFFUL
#define I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_HCNT_Pos 16UL
#define I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_HCNT_Msk 0xFF0000UL
/* I3C_CORE.SCL_I3C_PP_TIMING */
#define I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_LCNT_Pos 0UL
#define I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_LCNT_Msk 0xFFUL
#define I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_HCNT_Pos 16UL
#define I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_HCNT_Msk 0xFF0000UL
/* I3C_CORE.SCL_I2C_FM_TIMING */
#define I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_LCNT_Pos 0UL
#define I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_LCNT_Msk 0xFFFFUL
#define I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_HCNT_Pos 16UL
#define I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_HCNT_Msk 0xFFFF0000UL
/* I3C_CORE.SCL_I2C_FMP_TIMING */
#define I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_LCNT_Pos 0UL
#define I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_LCNT_Msk 0xFFFFUL
#define I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_HCNT_Pos 16UL
#define I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_HCNT_Msk 0xFF0000UL
/* I3C_CORE.SCL_EXT_LCNT_TIMING */
#define I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_1_Pos 0UL
