PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_i3c_v1_1.h
#define I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_1_Msk 0xFFUL
#define I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_2_Pos 8UL
#define I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_2_Msk 0xFF00UL
#define I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_3_Pos 16UL
#define I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_3_Msk 0xFF0000UL
#define I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_4_Pos 24UL
#define I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_4_Msk 0xFF000000UL
/* I3C_CORE.SCL_EXT_TERMN_LCNT_TIMING */
#define I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING_I3C_EXT_TERMN_LCNT_Pos 0UL
#define I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING_I3C_EXT_TERMN_LCNT_Msk 0xFUL
#define I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING_STOP_HLD_CNT_Pos 28UL
#define I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING_STOP_HLD_CNT_Msk 0xF0000000UL
/* I3C_CORE.SDA_HOLD_SWITCH_DLY_TIMING */
#define I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING_SDA_OD_PP_SWITCH_DLY_Pos 0UL
#define I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING_SDA_OD_PP_SWITCH_DLY_Msk 0x7UL
#define I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING_SDA_PP_OD_SWITCH_DLY_Pos 8UL
#define I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING_SDA_PP_OD_SWITCH_DLY_Msk 0x700UL
#define I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING_SDA_TX_HOLD_Pos 16UL
#define I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING_SDA_TX_HOLD_Msk 0x70000UL
/* I3C_CORE.BUS_FREE_AVAIL_TIMING */
#define I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_FREE_TIME_Pos 0UL
#define I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_FREE_TIME_Msk 0xFFFFUL
#define I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_AVAILABLE_TIME_Pos 16UL
#define I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_AVAILABLE_TIME_Msk 0xFFFF0000UL
/* I3C_CORE.BUS_IDLE_TIMING */
#define I3C_CORE_BUS_IDLE_TIMING_BUS_IDLE_TIME_Pos 0UL
#define I3C_CORE_BUS_IDLE_TIMING_BUS_IDLE_TIME_Msk 0xFFFFFUL
/* I3C_CORE.SCL_LOW_CTR_EXT_TIMEOUT */
#define I3C_CORE_SCL_LOW_CTR_EXT_TIMEOUT_SCL_LOW_CTR_TIMEOUT_COUNT_Pos 0UL
#define I3C_CORE_SCL_LOW_CTR_EXT_TIMEOUT_SCL_LOW_CTR_TIMEOUT_COUNT_Msk 0x3FFFFFFUL
/* I3C_CORE.RELEASE_SDA_TIMING */
#define I3C_CORE_RELEASE_SDA_TIMING_RELEASE_SDA_TIME_Pos 0UL
#define I3C_CORE_RELEASE_SDA_TIMING_RELEASE_SDA_TIME_Msk 0xFFFFFUL
/* I3C_CORE.EXT_TX_DATA_PORT_0 */
#define I3C_CORE_EXT_TX_DATA_PORT_0_EXT_TX_DATA_PORT_0_Pos 0UL
#define I3C_CORE_EXT_TX_DATA_PORT_0_EXT_TX_DATA_PORT_0_Msk 0xFFFFFFFFUL
/* I3C_CORE.EXT_TX_DATA_PORT_1 */
#define I3C_CORE_EXT_TX_DATA_PORT_1_EXT_TX_DATA_PORT_1_Pos 0UL
#define I3C_CORE_EXT_TX_DATA_PORT_1_EXT_TX_DATA_PORT_1_Msk 0xFFFFFFFFUL
/* I3C_CORE.EXT_TX_DATA_PORT_2 */
#define I3C_CORE_EXT_TX_DATA_PORT_2_EXT_TX_DATA_PORT_2_Pos 0UL
#define I3C_CORE_EXT_TX_DATA_PORT_2_EXT_TX_DATA_PORT_2_Msk 0xFFFFFFFFUL
/* I3C_CORE.EXT_TX_DATA_PORT_3 */
#define I3C_CORE_EXT_TX_DATA_PORT_3_EXT_TX_DATA_PORT_3_Pos 0UL
#define I3C_CORE_EXT_TX_DATA_PORT_3_EXT_TX_DATA_PORT_3_Msk 0xFFFFFFFFUL
/* I3C_CORE.EXT_0_1_DATA_BUF_STS_LEVEL */
#define I3C_CORE_EXT_0_1_DATA_BUF_STS_LEVEL_EXT_0_TX_BUF_EMPTY_LOC_Pos 0UL
#define I3C_CORE_EXT_0_1_DATA_BUF_STS_LEVEL_EXT_0_TX_BUF_EMPTY_LOC_Msk 0xFFUL
#define I3C_CORE_EXT_0_1_DATA_BUF_STS_LEVEL_EXT_1_TX_BUF_EMPTY_LOC_Pos 16UL
#define I3C_CORE_EXT_0_1_DATA_BUF_STS_LEVEL_EXT_1_TX_BUF_EMPTY_LOC_Msk 0xFF0000UL
/* I3C_CORE.EXT_2_3_DATA_BUF_STS_LEVEL */
#define I3C_CORE_EXT_2_3_DATA_BUF_STS_LEVEL_EXT_2_TX_BUF_EMPTY_LOC_Pos 0UL
#define I3C_CORE_EXT_2_3_DATA_BUF_STS_LEVEL_EXT_2_TX_BUF_EMPTY_LOC_Msk 0xFFUL
#define I3C_CORE_EXT_2_3_DATA_BUF_STS_LEVEL_EXT_3_TX_BUF_EMPTY_LOC_Pos 16UL
#define I3C_CORE_EXT_2_3_DATA_BUF_STS_LEVEL_EXT_3_TX_BUF_EMPTY_LOC_Msk 0xFF0000UL
/* I3C_CORE.EXT_CMD_REG_0 */
#define I3C_CORE_EXT_CMD_REG_0_TID_Pos          3UL
#define I3C_CORE_EXT_CMD_REG_0_TID_Msk          0x38UL
#define I3C_CORE_EXT_CMD_REG_0_DL_LSB_Pos       6UL
#define I3C_CORE_EXT_CMD_REG_0_DL_LSB_Msk       0xC0UL
#define I3C_CORE_EXT_CMD_REG_0_DEFINING_BYTE_Pos 16UL
#define I3C_CORE_EXT_CMD_REG_0_DEFINING_BYTE_Msk 0xFF0000UL
#define I3C_CORE_EXT_CMD_REG_0_CCC_TYPE_Pos     24UL
#define I3C_CORE_EXT_CMD_REG_0_CCC_TYPE_Msk     0xFF000000UL
/* I3C_CORE.EXT_CMD_REG_1 */
#define I3C_CORE_EXT_CMD_REG_1_TID_Pos          3UL
#define I3C_CORE_EXT_CMD_REG_1_TID_Msk          0x38UL
#define I3C_CORE_EXT_CMD_REG_1_DL_LSB_Pos       6UL
#define I3C_CORE_EXT_CMD_REG_1_DL_LSB_Msk       0xC0UL
#define I3C_CORE_EXT_CMD_REG_1_DEFINING_BYTE_Pos 16UL
#define I3C_CORE_EXT_CMD_REG_1_DEFINING_BYTE_Msk 0xFF0000UL
#define I3C_CORE_EXT_CMD_REG_1_CCC_TYPE_Pos     24UL
#define I3C_CORE_EXT_CMD_REG_1_CCC_TYPE_Msk     0xFF000000UL
/* I3C_CORE.EXT_CMD_REG_2 */
#define I3C_CORE_EXT_CMD_REG_2_TID_Pos          3UL
#define I3C_CORE_EXT_CMD_REG_2_TID_Msk          0x38UL
#define I3C_CORE_EXT_CMD_REG_2_DL_LSB_Pos       6UL
#define I3C_CORE_EXT_CMD_REG_2_DL_LSB_Msk       0xC0UL
#define I3C_CORE_EXT_CMD_REG_2_DEFINING_BYTE_Pos 16UL
#define I3C_CORE_EXT_CMD_REG_2_DEFINING_BYTE_Msk 0xFF0000UL
#define I3C_CORE_EXT_CMD_REG_2_CCC_TYPE_Pos     24UL
#define I3C_CORE_EXT_CMD_REG_2_CCC_TYPE_Msk     0xFF000000UL
/* I3C_CORE.EXT_CMD_REG_3 */
#define I3C_CORE_EXT_CMD_REG_3_TID_Pos          3UL
#define I3C_CORE_EXT_CMD_REG_3_TID_Msk          0x38UL
#define I3C_CORE_EXT_CMD_REG_3_DL_LSB_Pos       6UL
#define I3C_CORE_EXT_CMD_REG_3_DL_LSB_Msk       0xC0UL
#define I3C_CORE_EXT_CMD_REG_3_DEFINING_BYTE_Pos 16UL
#define I3C_CORE_EXT_CMD_REG_3_DEFINING_BYTE_Msk 0xFF0000UL
#define I3C_CORE_EXT_CMD_REG_3_CCC_TYPE_Pos     24UL
#define I3C_CORE_EXT_CMD_REG_3_CCC_TYPE_Msk     0xFF000000UL
/* I3C_CORE.EXT_TX_QUEUE_RESET_CTRL */
#define I3C_CORE_EXT_TX_QUEUE_RESET_CTRL_EXT_TX_FIFO_RST_0_Pos 0UL
#define I3C_CORE_EXT_TX_QUEUE_RESET_CTRL_EXT_TX_FIFO_RST_0_Msk 0x1UL
#define I3C_CORE_EXT_TX_QUEUE_RESET_CTRL_EXT_TX_FIFO_RST_1_Pos 1UL
#define I3C_CORE_EXT_TX_QUEUE_RESET_CTRL_EXT_TX_FIFO_RST_1_Msk 0x2UL
#define I3C_CORE_EXT_TX_QUEUE_RESET_CTRL_EXT_TX_FIFO_RST_2_Pos 2UL
#define I3C_CORE_EXT_TX_QUEUE_RESET_CTRL_EXT_TX_FIFO_RST_2_Msk 0x4UL
#define I3C_CORE_EXT_TX_QUEUE_RESET_CTRL_EXT_TX_FIFO_RST_3_Pos 3UL
#define I3C_CORE_EXT_TX_QUEUE_RESET_CTRL_EXT_TX_FIFO_RST_3_Msk 0x8UL
/* I3C_CORE.DEV_CHAR_TABLE1_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE1_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE1_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE1_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE1_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE1_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE1_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE1_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE1_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE1_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE1_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE1_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE1_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE1_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE2_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE2_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE2_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE2_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE2_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE2_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE2_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE2_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE2_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE2_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE2_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE2_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE2_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE2_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE3_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE3_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE3_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE3_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE3_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE3_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE3_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE3_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE3_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE3_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE3_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE3_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE3_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE3_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE4_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE4_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE4_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE4_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE4_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE4_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE4_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE4_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE4_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE4_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE4_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE4_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE4_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE4_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE5_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE5_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE5_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE5_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE5_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE5_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE5_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE5_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE6_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE6_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE6_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE6_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE6_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE6_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE6_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE6_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE7_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE7_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE7_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE7_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE7_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE7_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE7_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE7_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE8_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE8_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE8_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE8_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE8_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE8_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE8_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE8_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE9_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE9_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE9_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE9_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE9_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE9_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE9_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE9_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE10_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE10_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE10_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE10_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE10_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE10_LOC3_DCR_Pos  0UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC3_DCR_Msk  0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC3_BCR_Pos  8UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC3_BCR_Msk  0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE10_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE10_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE11_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE11_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE11_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE11_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE11_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE11_LOC3_DCR_Pos  0UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC3_DCR_Msk  0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC3_BCR_Pos  8UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC3_BCR_Msk  0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE11_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE11_LOC4_DEV_DYNAMIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFFUL
/* I3C_CORE.DEV_ADDR_TABLE_LOC1 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_TS_Pos     15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_TS_Msk     0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC2 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_TS_Pos     15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_TS_Msk     0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC3 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_TS_Pos     15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_TS_Msk     0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC4 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_TS_Pos     15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_TS_Msk     0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC5 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_TS_Pos     15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_TS_Msk     0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC6 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_TS_Pos     15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_TS_Msk     0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC7 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_TS_Pos     15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_TS_Msk     0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC8 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_TS_Pos     15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_TS_Msk     0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC9 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_TIR_REJECT_Pos 13UL
