PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_i3c_v1_1.h
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_TS_Pos     15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_TS_Msk     0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC10 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_TS_Pos    15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_TS_Msk    0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC11 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_IBI_PEC_EN_Pos 11UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_IBI_PEC_EN_Msk 0x800UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_IBI_WITH_DATA_Pos 12UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_IBI_WITH_DATA_Msk 0x1000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_TIR_REJECT_Pos 13UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_TIR_REJECT_Msk 0x2000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_CR_REJECT_Pos 14UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_CR_REJECT_Msk 0x4000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_TS_Pos    15UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_TS_Msk    0x8000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_LEGACY_I2C_DEVICE_Msk 0x80000000UL


/* I3C.CTRL */
#define I3C_CTRL_ENABLED_Pos                    31UL
#define I3C_CTRL_ENABLED_Msk                    0x80000000UL
/* I3C.TGT_STATUS */
#define I3C_TGT_STATUS_WAKEUP_Pos               0UL
#define I3C_TGT_STATUS_WAKEUP_Msk               0x1UL
#define I3C_TGT_STATUS_I2C_GLITCH_FILTER_EN_Pos 8UL
#define I3C_TGT_STATUS_I2C_GLITCH_FILTER_EN_Msk 0x100UL
#define I3C_TGT_STATUS_IBI_PAYLOAD_SIZE_Pos     16UL
#define I3C_TGT_STATUS_IBI_PAYLOAD_SIZE_Msk     0xFF0000UL
/* I3C.CCC_GETSTATUS */
#define I3C_CCC_GETSTATUS_PENDING_INT_Pos       16UL
#define I3C_CCC_GETSTATUS_PENDING_INT_Msk       0xF0000UL
#define I3C_CCC_GETSTATUS_ACT_MODE_Pos          24UL
#define I3C_CCC_GETSTATUS_ACT_MODE_Msk          0x3000000UL
/* I3C.TIMING_CNT_CTRL */
#define I3C_TIMING_CNT_CTRL_CNT_RESET_Pos       30UL
#define I3C_TIMING_CNT_CTRL_CNT_RESET_Msk       0x40000000UL
#define I3C_TIMING_CNT_CTRL_CNT_ENABLE_Pos      31UL
#define I3C_TIMING_CNT_CTRL_CNT_ENABLE_Msk      0x80000000UL
/* I3C.TIMING_CNT0 */
#define I3C_TIMING_CNT0_TIMING_COUNTER_MSB_Pos  0UL
#define I3C_TIMING_CNT0_TIMING_COUNTER_MSB_Msk  0xFFFFFFFFUL
/* I3C.TIMING_CNT1 */
#define I3C_TIMING_CNT1_TIMING_COUNTER_LSB_Pos  0UL
#define I3C_TIMING_CNT1_TIMING_COUNTER_LSB_Msk  0xFFFFFFFFUL


#endif /* _CYIP_I3C_V1_1_H_ */


/* [] END OF FILE */
